      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 
      *    RELEASE 9.4.6  CRS DISCOUNT FILE TRAILER RECORD          * 
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * 
       01  XX-CRS-TRAILER.                                            
           05 FILLER               PIC X(06)     VALUE HIGH-VALUES.   
           05 XX-TOTAL-RECORDS     PIC 9(08)     VALUE ZEROES.        
           05 FILLER               PIC X(72)     VALUE HIGH-VALUES.   
      * * * * * * * * * * *  END OF RECORD  * * * * * * * * * * * * *
